# Dataset
1. [Edmonton Property Assessment Data](https://data.edmonton.ca/City-Administration/Property-Assessment-Data-Current-Calendar-Year-/q7d6-ambg/data)
2. [EPS Neighbourhood Criminal Occurrences](https://dashboard.edmonton.ca/dataset/EPS-Neighbourhood-Criminal-Occurrences/xthe-mnvi/data)
3.

In [20]:
import pandas as pd
import numpy as np
import matplotlib.cm as cm
import matplotlib.colors as colors
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.cluster import KMeans
import pickle as pkl

In [29]:
file_name = "Property_Assessment_Data__Current_Calendar_Year_.csv"
df_prop = pd.read_csv(file_name)
df_prop.info()

# print(df_prop.iloc[:,6].unique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 416090 entries, 0 to 416089
Data columns (total 18 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Account Number        416090 non-null  int64
 1   Suite                 81496 non-null   object
 2   House Number          371650 non-null  float64
 3   Street Name           371650 non-null  object
 4   Garage                416090 non-null  object
 5   Neighbourhood ID      416084 non-null  float64
 6   Neighbourhood         416084 non-null  object
 7   Ward                  416084 non-null  object
 8   Assessed Value        416090 non-null  int64
 9   Latitude              416090 non-null  float64
 10  Longitude             416090 non-null  float64
 11  Point Location        416090 non-null  object
 12  Assessment Class % 1  416090 non-null  int64
 13  Assessment Class % 2  1092 non-null    float64
 14  Assessment Class % 3  297 non-null     float64
 15  Assessment Class 1    416090 non-null  object
 16  Assessment Class 2    1092 non-null    object
 17  Assessment Class 3    297 non-null     object
dtypes: float64(6), int64(3), object(9)
memory usage: 57.1+ MB

In [34]:
# cleanup data
# Keep residential only
# df_prop['Assessment Class 1'].unique()

df_prop = df_prop[df_prop['Assessment Class 1'] == 'RESIDENTIAL']
# df_prop.info()

df2 = df_prop.filter(['Neighbourhood','Assessed Value','Latitude','Longitude'], axis=1)
df2

<class 'pandas.core.frame.DataFrame'>
Int64Index: 389167 entries, 0 to 416089
Data columns (total 18 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Account Number        389167 non-null  int64
 1   Suite                 80287 non-null   object
 2   House Number          346917 non-null  float64
 3   Street Name           346917 non-null  object
 4   Garage                389167 non-null  object
 5   Neighbourhood ID      389163 non-null  float64
 6   Neighbourhood         389163 non-null  object
 7   Ward                  389163 non-null  object
 8   Assessed Value        389167 non-null  int64
 9   Latitude              389167 non-null  float64
 10  Longitude             389167 non-null  float64
 11  Point Location        389167 non-null  object
 12  Assessment Class % 1  389167 non-null  int64
 13  Assessment Class % 2  446 non-null     float64
 14  Assessment Class % 3  240 non-null     float64
 15  Assessment Class 1    389167 non-null  object
 16  Assessment Class 2    446 non-null     object
 17  Assessment Class 3    240 non-null     object
dtypes: float64(6), int64(3), object(9)
memory usage: 56.4+ MB

                Neighbourhood  Assessed Value   Latitude   Longitude
0                 BONNIE DOON          689000  53.524384 -113.470251
1                       ASTER          421500  53.452787 -113.363143
2                  KLARVATTEN          148000  53.645346 -113.483216
4                      WALKER          255000  53.412276 -113.432416
5       CRYSTALLINA NERA EAST          136500  53.645347 -113.450442
...                       ...             ...        ...         ...
416084                 LAUREL          281500  53.439974 -113.382952
416086               CAVANAGH          360000  53.406345 -113.508021
416087                 LAUREL          106500  53.443156 -113.374378
416088          NORTH GLENORA         1133500  53.553839 -113.563464
416089     GLENRIDDING RAVINE          509500  53.404891 -113.604906

[389167 rows x 4 columns]

In [24]:
file_name = "EPS_Neighbourhood_Criminal_Occurrences.csv"
df_eps = pd.read_csv(file_name)
df_eps.head(5)

df = df_eps[df_eps["Occurrence Reported Year"] == 2019]
# print(df.iloc[:,0].unique())
df.columns = ["neighbourhood","type","year","quarter","month","occurrences"]
df.head(5)

df2 = df.groupby(['neighbourhood'], as_index=False)['occurrences'].sum()

df2.to_pickle("eps.pkl")

df2

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9285 entries, 45 to 113076
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   neighbourhood  9285 non-null   object
 1   type           9285 non-null   object
 2   year           9285 non-null   int64
 3   quarter        9285 non-null   object
 4   month          9285 non-null   int64
 5   occurrences    9285 non-null   int64
dtypes: int64(3), object(3)
memory usage: 507.8+ KB

                neighbourhood  occurrences
0                ABBOTTSFIELD           64
1                      ALBANY           25
2              ALBERTA AVENUE          430
3     ALBERTA PARK INDUSTRIAL           18
4                  ALDERGROVE           59
..                        ...          ...
371                 WOODCROFT          106
372  YELLOWHEAD CORRIDOR EAST           60
373  YELLOWHEAD CORRIDOR WEST            6
374                      YORK           88
375     YOUNGSTOWN INDUSTRIAL           26

[376 rows x 2 columns]